stress_test.yml
execution:
    - executor: jmeter
      concurrency: 10
      ramp-up: 10s
      hold-for: 50s
      scenario: monitor-notifier
    
scenarios:
    notifier:
        requests:
        - once:
          - url: http://0.0.0.0:8080/notifier/email
            method: POST
            label: post-email
            assert:
            - contains:
              - "200|403"
              subject: http-code
              regexp: true
            headers:
              Content-Type: application/json
            body: 
              id_line: testeo
              email: testeo@email.com

        - url: http://0.0.0.0:8080/notifier/email
          method: GET
          label: get-email
          assert:
          - contains:
            - "200|404"
            subject: http-code
            regexp: true
          headers: 
            Content-Type: application/json
          body:
            email: testeo@email.com

    monitor:
        requests:
        - url: http://0.0.0.0:8081/monitor/status
          method: GET
          label: get-status
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

        - url: http://0.0.0.0:8081/monitor/status/service
          method: GET
          label: get-status-service
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            service: GitHub Actions

        - url: http://0.0.0.0:8081/monitor/status/types
          method: GET
          label: get-status-types
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

        - url: http://0.0.0.0:8081/monitor/services
          method: GET
          label: get-services
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

        - url: http://0.0.0.0:8081/monitor/downtime/record
          method: GET
          label: get-downtime-record
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            service: GitHub Actions

        - url: http://0.0.0.0:8081/monitor/downtime
          method: GET
          label: get-downtime
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            id: 1

    monitor-notifier:
      requests:
      - once:
        - url: http://0.0.0.0:8081/monitor/status
          method: GET
          label: get-status
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true
      - once:
        - url: http://0.0.0.0:8081/monitor/status/service
          method: GET
          label: get-status-service
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            service: GitHub Actions

      - url: http://0.0.0.0:8081/monitor/status/types
        method: GET
        label: get-status-types
        assert:
        - contains:
          - "200"
          subject: http-code
          regexp: true

      - once:
        - url: http://0.0.0.0:8081/monitor/services
          method: GET
          label: get-services
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

      - once:
        - url: http://0.0.0.0:8081/monitor/downtime/record
          method: GET
          label: get-downtime-record
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            service: GitHub Actions

      - once:
        - url: http://0.0.0.0:8081/monitor/downtime
          method: GET
          label: get-downtime
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            id: 1

      - once:
        - url: http://0.0.0.0:8080/notifier/email
          method: POST
          label: post-email
          assert:
          - contains:
            - "200|403"
            subject: http-code
            regexp: true
          headers:
            Content-Type: application/json
          body: 
            id_line: testeo
            email: testeo@email.com

      - url: http://0.0.0.0:8080/notifier/email
        method: GET
        label: get-email
        assert:
        - contains:
          - "200|404"
          subject: http-code
          regexp: true

        headers: 
          Content-Type: application/json
        body:
          email: testeo@email.com