stress_test.yml
execution:
    # Herramienta con la que se ejecutará los tests
    - executor: jmeter
      # Número de usuarios concurrentes
      concurrency: 10
      # El número de usuarios irá aunmentando duranre 10s
      ramp-up: 10s
      # Duuración de la prueba
      hold-for: 50s
      # Escenario que se usará en la prueba
      scenario: monitor-notifier
   
# Escenarios que se describirán
scenarios:
    # Nombre del escenario
    notifier:
        # Peticiones que se van a hacer
        requests:
        # Indica que la petición se realizará una vez por hebra
        - once:
            # URL dónde se hará la petición
          - url: http://0.0.0.0:8080/notifier/email
            # Verbo HTTP
            method: POST
            # Etiqueta para identificar la petición
            label: post-email
            # Aserciones que se tienen que cumplir
            # El código que devuelva esta petición debe ser 200 o 403
            assert:
            - contains:
              - "200|403"
              subject: http-code
              regexp: true
            # Cabeceras de la petición
            headers:
              # Tipo de contenido que se enviará
              Content-Type: application/json
            # JSON que se enviará en el body de la petición
            body: 
              id_line: testeo
              email: testeo@email.com

        - url: http://0.0.0.0:8080/notifier/email
          method: GET
          label: get-email
          assert:
          - contains:
            - "200|404"
            subject: http-code
            regexp: true
          headers: 
            Content-Type: application/json
          body:
            email: testeo@email.com

    monitor:
        requests:
        - url: http://0.0.0.0:8081/monitor/status
          method: GET
          label: get-status
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

        - url: http://0.0.0.0:8081/monitor/status/service
          method: GET
          label: get-status-service
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            service: GitHub Actions

        - url: http://0.0.0.0:8081/monitor/status/types
          method: GET
          label: get-status-types
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

        - url: http://0.0.0.0:8081/monitor/services
          method: GET
          label: get-services
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

        - url: http://0.0.0.0:8081/monitor/downtime/record
          method: GET
          label: get-downtime-record
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            service: GitHub Actions

        - url: http://0.0.0.0:8081/monitor/downtime
          method: GET
          label: get-downtime
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            id: 1

    monitor-vm:
      requests:
        - once:
          - url: http://0.0.0.0:8081/monitor/status
            method: GET
            label: get-status
            assert:
            - contains:
              - "200"
              subject: http-code
              regexp: true
        - once:
          - url: http://0.0.0.0:8081/monitor/status/service
            method: GET
            label: get-status-service
            assert:
            - contains:
              - "200"
              subject: http-code
              regexp: true
  
            headers: 
              Content-Type: application/json
            body:
              service: GitHub Actions
  
        - url: http://0.0.0.0:8081/monitor/status/types
          method: GET
          label: get-status-types
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true
  
        - once:
          - url: http://0.0.0.0:8081/monitor/services
            method: GET
            label: get-services
            assert:
            - contains:
              - "200"
              subject: http-code
              regexp: true
  
        - once:
          - url: http://0.0.0.0:8081/monitor/downtime/record
            method: GET
            label: get-downtime-record
            assert:
            - contains:
              - "200"
              subject: http-code
              regexp: true
  
            headers: 
              Content-Type: application/json
            body:
              service: GitHub Actions
  
        - once:
          - url: http://0.0.0.0:8081/monitor/downtime
            method: GET
            label: get-downtime
            assert:
            - contains:
              - "200"
              subject: http-code
              regexp: true
  
            headers: 
              Content-Type: application/json
            body:
              id: 1

    monitor-notifier:
      requests:
      - once:
        - url: http://137.135.15.76:8081/monitor/status
          method: GET
          label: get-status
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true
      - once:
        - url: http://137.135.15.76:8081/monitor/status/service
          method: GET
          label: get-status-service
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            service: GitHub Actions

      - url: http://137.135.15.76:8081/monitor/status/types
        method: GET
        label: get-status-types
        assert:
        - contains:
          - "200"
          subject: http-code
          regexp: true

      - once:
        - url: http://137.135.15.76:8081/monitor/services
          method: GET
          label: get-services
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

      - once:
        - url: http://137.135.15.76:8081/monitor/downtime/record
          method: GET
          label: get-downtime-record
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            service: GitHub Actions

      - once:
        - url: http://137.135.15.76:8081/monitor/downtime
          method: GET
          label: get-downtime
          assert:
          - contains:
            - "200"
            subject: http-code
            regexp: true

          headers: 
            Content-Type: application/json
          body:
            id: 1

      - once:
        - url: http://137.135.15.76:8080/notifier/email
          method: POST
          label: post-email
          assert:
          - contains:
            - "200|403"
            subject: http-code
            regexp: true
          headers:
            Content-Type: application/json
          body: 
            id_line: testeo
            email: testeo@email.com

      - url: http://137.135.15.76:8080/notifier/email
        method: GET
        label: get-email
        assert:
        - contains:
          - "200|404"
          subject: http-code
          regexp: true

        headers: 
          Content-Type: application/json
        body:
          email: testeo@email.com